In [1]:
import pandas as pd

In [5]:
data = {
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Department': ['HR', 'IT', 'Finance', 'Marketing', 'Sales'],
    'Salary': [60000, 75000, 80000, 70000, 65000]
}

In [6]:
employees =  pd.DataFrame(data)

In [7]:
employees.head(3)

   EmployeeID     Name Department  Salary
0         101    Alice         HR   60000
1         102      Bob         IT   75000
2         103  Charlie    Finance   80000

In [18]:
employees["Salary"].describe()

count        5.00000
mean     70000.00000
std       7905.69415
min      60000.00000
25%      65000.00000
50%      70000.00000
75%      75000.00000
max      80000.00000
Name: Salary, dtype: float64

In [27]:
number_of_employees = employees.groupby("Department")["EmployeeID"].count()

In [25]:
number_of_employees

Department
Finance      103.0
HR           101.0
IT           102.0
Marketing    104.0
Sales        105.0
Name: EmployeeID, dtype: float64

In [28]:
avg_salary = employees["Salary"].mean()

In [38]:
avg_salary

70000.0

In [39]:
max_salary = employees["Salary"].max()

In [40]:
max_salary

80000

In [41]:
highest_salary_empl = employees[employees["Salary"] == max_salary]

In [45]:
highest_salary_empl

   EmployeeID     Name Department  Salary
2         103  Charlie    Finance   80000

In [55]:
lowest_avg_salary_empl_per_department = employees.groupby('Department')['Salary'].mean().idxmin()

In [56]:
lowest_avg_salary_empl_per_department

'HR'

In [49]:
employees["Salary Increase"] = employees["Salary"] * 1.10

In [50]:
employees["Salary Increase"]

0    66000.0
1    82500.0
2    88000.0
3    77000.0
4    71500.0
Name: Salary Increase, dtype: float64

In [51]:
employees

   EmployeeID     Name Department  Salary  Salary Increase
0         101    Alice         HR   60000          66000.0
1         102      Bob         IT   75000          82500.0
2         103  Charlie    Finance   80000          88000.0
3         104    David  Marketing   70000          77000.0
4         105     Emma      Sales   65000          71500.0